package org.example.java0703;

import java.util.Random;

public class WorkNumber {
    public static void main(String[] args) {
//        Создать программу, выводящую на экран случайно
//        сгенерированное трёхзначное натуральное число и
//        его наибольшую цифру. Например: 398 Выход: 9

//        Random random = new Random();
//        int num = 897;//random.nextInt(900) + 100;
//        // 897
//        int n_last = num % 10; //7
//        int n_first = num / 100; //8
//        int n_middle = num /10 % 10; //9
//
//        int maxNum = n_first;
//        if (maxNum>n_middle && maxNum > n_last) {
//            System.out.println(maxNum);
//        } if(n_first > n_middle && n_first> n_last){
//            System.out.println(n_first);
//        } else if (n_middle> n_first && n_middle> n_last) {
//            System.out.println(n_middle);
//        }else {
//            System.out.println(n_last);
//        }
//
//        System.out.println(n_first+" "+n_middle+" "+n_last);

//        Создать программу, проверяющую и сообщающую на экран,
//        является ли целое число записанное в переменную n,
//        чётным либо нечётным.
//         int n = 9;
//         if ( int result = n % == 1 ) {
//             System.out.println("число не четное");
//         } else System.out.println("число четное");

//        Создать программу, выводящую на экран ближайшее к 10
//        из двух чисел, записанных в переменные m и n. Например,
//        среди чисел 8,5 и 11,45 ближайшее к десяти 11,45.



    }
}
