package org.example.java2102;

public class Today {
//    Вывести на экран в одну строку все нечётные числа от 0 до 100.
    public static void main(String[] args) {
        int i = 1;
        while (i < 100) {
            System.out.print(i +" ");
            i+=2;
        }
    }
}


